tests/incompressibleDarcy_01/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 0;

boundaryField
{
    top
    {
        type            empty;
    }
    bottom
    {
        type            empty;
    }
    frontAndBack
    {
        type            empty;
    }
    right
    {
        type            fixedValue;
        value           uniform 0;
    }
    left
    {
        type            fixedValue;
		value		    uniform 0;
    }
}

// ************************************************************************* //
